Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Create Method (RebarSpacing.SpacingType, RebarSpacing.Offset, RebarSpacing.Offset, Double)
 Create a spacing which is defined by a single distance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarSpacing Create(
	RebarSpacing.SpacingType type,
	RebarSpacing.Offset startOffset,
	RebarSpacing.Offset endOffset,
	double distance
)
Public Shared Function Create (
	type As RebarSpacing.SpacingType,
	startOffset As RebarSpacing.Offset,
	endOffset As RebarSpacing.Offset,
	distance As Double
) As RebarSpacing
Parameters
type
Type: Tekla.Structures.Model.RebarSpacing.SpacingType
The type of spacing.
startOffset
Type: Tekla.Structures.Model.RebarSpacing.Offset
The start offset.
endOffset
Type: Tekla.Structures.Model.RebarSpacing.Offset
The end offset.
distance
Type: System.Double
The spacing distance.
Return Value
Type: RebarSpacing
A RebarSpacing instance if the given type and distance are valid.
See Also
Reference
RebarSpacing Class
Create Overload
Tekla.Structures.Model Namespace